OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16f18344.h
extern __at(0x0E1A) __sfr MDCIN1PPS;

typedef union
  {
  struct
    {
    unsigned MDCIN1PPS0         : 1;
    unsigned MDCIN1PPS1         : 1;
    unsigned MDCIN1PPS2         : 1;
    unsigned MDCIN1PPS3         : 1;
    unsigned MDCIN1PPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MDCIN1PPS          : 5;
    unsigned                    : 3;
    };
  } __MDCIN1PPSbits_t;

extern __at(0x0E1A) volatile __MDCIN1PPSbits_t MDCIN1PPSbits;

#define _MDCIN1PPS0             0x01
#define _MDCIN1PPS1             0x02
#define _MDCIN1PPS2             0x04
#define _MDCIN1PPS3             0x08
#define _MDCIN1PPS4             0x10

//==============================================================================


//==============================================================================
//        MDCIN2PPS Bits

extern __at(0x0E1B) __sfr MDCIN2PPS;

typedef union
  {
  struct
    {
    unsigned MDCIN2PPS0         : 1;
    unsigned MDCIN2PPS1         : 1;
    unsigned MDCIN2PPS2         : 1;
    unsigned MDCIN2PPS3         : 1;
    unsigned MDCIN2PPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MDCIN2PPS          : 5;
    unsigned                    : 3;
    };
  } __MDCIN2PPSbits_t;

extern __at(0x0E1B) volatile __MDCIN2PPSbits_t MDCIN2PPSbits;

#define _MDCIN2PPS0             0x01
#define _MDCIN2PPS1             0x02
#define _MDCIN2PPS2             0x04
#define _MDCIN2PPS3             0x08
#define _MDCIN2PPS4             0x10

//==============================================================================


//==============================================================================
//        MDMINPPS Bits

extern __at(0x0E1C) __sfr MDMINPPS;

typedef union
  {
  struct
    {
    unsigned MDMINPPS0          : 1;
    unsigned MDMINPPS1          : 1;
    unsigned MDMINPPS2          : 1;
    unsigned MDMINPPS3          : 1;
    unsigned MDMINPPS4          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned MDMINPPS           : 5;
    unsigned                    : 3;
    };
  } __MDMINPPSbits_t;

extern __at(0x0E1C) volatile __MDMINPPSbits_t MDMINPPSbits;

#define _MDMINPPS0              0x01
#define _MDMINPPS1              0x02
#define _MDMINPPS2              0x04
#define _MDMINPPS3              0x08
#define _MDMINPPS4              0x10

//==============================================================================


//==============================================================================
//        SSP1CLKPPS Bits

extern __at(0x0E20) __sfr SSP1CLKPPS;

typedef union
  {
  struct
    {
    unsigned SSP1CLKPPS0        : 1;
    unsigned SSP1CLKPPS1        : 1;
    unsigned SSP1CLKPPS2        : 1;
    unsigned SSP1CLKPPS3        : 1;
    unsigned SSP1CLKPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSP1CLKPPS         : 5;
    unsigned                    : 3;
    };
  } __SSP1CLKPPSbits_t;

extern __at(0x0E20) volatile __SSP1CLKPPSbits_t SSP1CLKPPSbits;

#define _SSP1CLKPPS0            0x01
#define _SSP1CLKPPS1            0x02
#define _SSP1CLKPPS2            0x04
#define _SSP1CLKPPS3            0x08
#define _SSP1CLKPPS4            0x10

//==============================================================================


//==============================================================================
//        SSP1DATPPS Bits

extern __at(0x0E21) __sfr SSP1DATPPS;

typedef union
  {
  struct
    {
    unsigned SSP1DATPPS0        : 1;
    unsigned SSP1DATPPS1        : 1;
    unsigned SSP1DATPPS2        : 1;
    unsigned SSP1DATPPS3        : 1;
    unsigned SSP1DATPPS4        : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSP1DATPPS         : 5;
    unsigned                    : 3;
    };
  } __SSP1DATPPSbits_t;

extern __at(0x0E21) volatile __SSP1DATPPSbits_t SSP1DATPPSbits;

#define _SSP1DATPPS0            0x01
#define _SSP1DATPPS1            0x02
#define _SSP1DATPPS2            0x04
#define _SSP1DATPPS3            0x08
#define _SSP1DATPPS4            0x10

//==============================================================================


//==============================================================================
//        SSP1SSPPS Bits

extern __at(0x0E22) __sfr SSP1SSPPS;

typedef union
  {
  struct
    {
    unsigned SSP1SSPPS0         : 1;
    unsigned SSP1SSPPS1         : 1;
    unsigned SSP1SSPPS2         : 1;
    unsigned SSP1SSPPS3         : 1;
    unsigned SSP1SSPPS4         : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned SSP1SSPPS          : 5;
    unsigned                    : 3;
    };
  } __SSP1SSPPSbits_t;

extern __at(0x0E22) volatile __SSP1SSPPSbits_t SSP1SSPPSbits;

#define _SSP1SSPPS0             0x01
#define _SSP1SSPPS1             0x02
#define _SSP1SSPPS2             0x04
#define _SSP1SSPPS3             0x08
#define _SSP1SSPPS4             0x10

//==============================================================================


//==============================================================================
//        RXPPS Bits

extern __at(0x0E24) __sfr RXPPS;

typedef union
  {
  struct
    {
    unsigned RXDTPPS0           : 1;
    unsigned RXDTPPS1           : 1;
    unsigned RXDTPPS2           : 1;
    unsigned RXDTPPS3           : 1;
    unsigned RXDTPPS4           : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned RXDTPPS            : 5;
    unsigned                    : 3;
    };
  } __RXPPSbits_t;

